#include <otto.h>

int notes[] ={
  G ,E5, D5, C5, G,//雪花隨風飄 1
   G ,E5, D5, C5, A,//花鹿在奔跑 2
   A, F5, E5, D5, B,//聖誕老公公 3
  G5, G5, F5, D5, E5, C5,//駕著美麗雪橇 4
    G ,E5, D5, C5, G,//經過了原野 5
  G ,E5, D5, C5, A,//越過了小橋 6
  A, F5, E5, D5,G5, G5,G5, G5,//跟著和平歡喜歌聲 7
  A5, G5, F5, D5, C5,//翩然地來到 8/// 65421
  E5, E5, E5, E5, E5, E5,//叮叮噹叮叮噹 9
  E5, G5, C5, D5, E5,//鈴聲多響亮 10
  F5, F5, F5, F5, F5, E5, E5, E5,//你看他呀不避風霜 11
  E5, D5, D5, C5, D5, G5,//面容多麼慈祥 12
  E5, E5, E5, E5, E5, E5,//叮叮噹叮叮噹 13
  E5, G5, C5, D5, E5,        //鈴聲多響亮 14
  F5, F5, F5, F5, F5, E5, E5, E5,//他給我們帶來幸福 15
 G5, G5,F5,D5, C5

};
// 決定每個音階的拍子，注意這邊用 unsigned long 所以拍子只能是正整數
byte beats[] = {
1,1,1,1,3,  //1雪花隨風飄
  1,1,1,1,3,  //2花鹿在奔跑
  1,1,1,1,3,  //3聖誕老公公 
 1,1,1,1,2,2, //4駕著美麗雪橇
  1,1,1,1,3,  //5經過了原野
  1,1,1,1,3,  //6越過了小橋
  1,1,1,1,1,1,1,1,//7跟著和平歡喜歌聲
  1,1,1,1,3,            //8翩然地來到
  1,1,2,1,1,2,        //9叮叮噹叮叮噹
  1,1,1,1,3,            //10鈴聲多響亮
  1,1,1,1,1,1,1,1,//11你看他呀不避風霜
  1,1,1,1,2,2,       //12面容多麼慈祥
  1,1,2,1,1,2,        //13叮叮噹叮叮噹-2
  1,1,1,1,3,            //14鈴聲多響亮-2
  1,1,1,1,1,1,1,1,//15他給我們帶來幸福
  1,1,1,1,4
};


void setup() {
  // put your setup code here, to run once:
  otto_UBInit(10,8,9);
}

void loop() {
  // put your main code here, to run repeatedly:
  for(int i=0;i<sizeof(beats);i++){
    int times = beats[i]* 200;
    tone(10, notes[i], times);
    delay(times*1.3);
  }  
  delay(1000);
  noTone(10);
}
